Revit 2026 API

# StructuralAssetSetPoissonRatio Method

---

Sets the Poisson ratio of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetPoissonRatio(
	double poissonRatio
)
```
```vb
Public Sub SetPoissonRatio (
	poissonRatio As Double
)
```
```cpp
public:
void SetPoissonRatio(
	double poissonRatio
)
```
```fsharp
member SetPoissonRatio :
        poissonRatio : float -> unit
```

#### Parameters

poissonRatio Double

The Poisson ratio is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace